Repository: Hicham1S/Hawacom_App
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Design App
ar: تطبيق التصميم

source: Click Here
ar: اضغط هنا

source: Add Story
ar: أضف ستوري

# search
source: Search for service...
ar: البحث عن الخدمة...

source: Live
ar: مباشر

# restContent
source: Rest of content will come here
ar: المحتوى سيأتي هنا

source: Ahmad Al-Shehri
ar: أحمد الشمري

source: Amina Al-Hajri
ar: أميمة الهاجري

source: Mohammed Ali
ar: محمد علي

source: Sarah Ahmed
ar: سارة أحمد

# startDesignProject
source: Start Design Project Now
ar: إبدأ مشروع التصميم الآن

# createAIImages
source: Create Images with AI
ar: اصنع صور عبر الذكاء الاصطناعي

source: Architectural Design
ar: تصميم معماري

source: Social Media
ar: سوشل ميديا

source: Interior Decor
ar: ديكور داخلي

source: Fashion Design
ar: تصميم أزياء

source: Hobbies
ar: هوايات

source: Projects Gallery
ar: معرض المشاريع

source: View All
ar: شاهد الكل

source: Add Story Coming Soon
ar: إضافة ستوري قريباً

# storyHasNoContent
source: This story has no content
ar: هذه القصة لا تحتوي على محتوى

source: Failed to load image
ar: فشل تحميل الصورة

# videoNotImplemented
source: Video playback not yet implemented
ar: تشغيل الفيديو غير متاح حالياً

# videoFileNotExist
source: Video file does not exist
ar: ملف الفيديو غير موجود

# videoFileTooLarge
source: Video file too large ({size} MB). Maximum is 10 MB
ar: حجم الفيديو كبير جداً ({size} ميجابايت). الحد الأقصى 10 ميجابايت

# videoTooShort
source: Video too short. Minimum is 1 second
ar: الفيديو قصير جداً. الحد الأدنى ثانية واحدة

# videoTooLong
source: Video too long ({duration} seconds). Maximum is 60 seconds
ar: الفيديو طويل جداً ({duration} ثانية). الحد الأقصى 60 ثانية

# videoReadError
source: Failed to read video file. Check video format
ar: فشل في قراءة ملف الفيديو. تأكد من صيغة الفيديو

# videoValidationError
source: Error validating video
ar: حدث خطأ أثناء التحقق من الفيديو

# videoRequirementsTitle
source: Video Requirements:
ar: متطلبات الفيديو:

# videoRequirementDuration
source: Duration: 1 to 60 seconds
ar: المدة: من 1 إلى 60 ثانية

# videoRequirementSize
source: Size: Under 10 MB
ar: الحجم: أقل من 10 ميجابايت

# videoRequirementFormat
source: Format: MP4 (recommended)
ar: الصيغة: MP4 (موصى به)

# videoRequirementResolution
source: Resolution: 720p or 1080p
ar: الدقة: 720p أو 1080p

# videoRequirementOrientation
source: Orientation: Vertical (9:16)
ar: الاتجاه: عمودي (9:16)

# addStoryTitle
source: Add Story
ar: إضافة ستوري

source: Publish
ar: نشر

source: Error
ar: خطأ

source: OK
ar: حسناً

# videoPickFailed
source: Failed to select video
ar: فشل في اختيار الفيديو

# imagePickFailed
source: Failed to select image
ar: فشل في اختيار الصورة

# videoRecordFailed
source: Failed to record video
ar: فشل في تسجيل الفيديو

# storyUploadingSoon
source: Story will be added soon
ar: سيتم إضافة ستوري قريباً

source: Record Video
ar: تسجيل فيديو

source: Select Video
ar: اختيار فيديو

source: Select Image
ar: اختيار صورة

source: Select image or video
ar: اختر صورة أو فيديو

# videoRequirementsSummary
source: Video: 1 to 60 seconds, under 10 MB
ar: الفيديو: من 1 إلى 60 ثانية، أقل من 10 ميجابايت

# videoValidating
source: Validating video...
ar: جاري التحقق من الفيديو...

# videoSuitable
source: Video is suitable ({duration})
ar: الفيديو مناسب ({duration})

source: Video selected
ar: فيديو محدد
